brew "stow"

# Neovim + tools for telescope/lsp/etc.
brew "neovim"
brew "ripgrep"
brew "fd"
brew "tmux"

# General CLI quality-of-life
brew "bat"            # syntax-highlighted `cat`
brew "btop"           # resource monitor / `top` replacement
brew "eza"            # modern `ls` with git status + tree
brew "fzf"            # fuzzy finder (powers shell widgets + git-recent helper)
brew "gh"             # GitHub CLI (personal use; work profile blocks via permissions)
brew "git-delta"      # syntax-highlighted git diffs (configured as core.pager)
brew "lazygit"        # TUI git client
brew "shellcheck"     # shell linter for any tracked .sh scripts
brew "zoxide"         # smart `cd` that learns frecent directories

# GUI apps (macOS only — Brewfile is gated to Darwin in bootstrap.sh)
cask "iterm2"

# Nerd Font (provides the icon glyphs used by lualine/gitsigns/nvim-web-devicons)
cask "font-jetbrains-mono-nerd-font"
